{"criteria": "Identification of Key Concepts and Major Principles (30 Points)", "description": "This section assesses how well the student identifies the relevant concepts and principles in solving the problem.", "points": 30.0, "labels": [{"label": "High", "description": "The student accurately identifies and names all relevant concepts and principles, demonstrating a comprehensive understanding of the problem.", "min": 27.0, "max": 30.0}, {"label": "Medium", "description": "Most relevant concepts are identified, but there are minor inaccuracies or omissions in the identification of principles.", "min": 19.0, "max": 26.0}, {"label": "Low", "description": "The student identifies some concepts, but there are significant errors or omissions in recognizing the relevant principles.", "min": 10.0, "max": 18.0}, {"label": "Very Low", "description": "The student fails to identify the relevant concepts and principles, or they are identified incorrectly.", "min": 0.0, "max": 9.0}], "sub_criteria": []}
{"criteria": "Explanation of Conceptual Relationships and Procedures (30 Points)", "description": "This section evaluates the student's ability to explain how the identified concepts interact and the procedures used to apply them.", "points": 30.0, "labels": [{"label": "High", "description": "The student provides a clear and detailed explanation of the relationships between concepts and the procedures for applying them, with no major omissions.", "min": 27.0, "max": 30.0}, {"label": "Medium", "description": "The explanation generally covers relationships and procedures but lacks detail or clarity in some areas.", "min": 19.0, "max": 26.0}, {"label": "Low", "description": "The explanation is basic or incomplete, with significant gaps in describing relationships and procedures.", "min": 10.0, "max": 18.0}, {"label": "Very Low", "description": "Little to no explanation of how concepts are related, or incorrect procedures are described.", "min": 0.0, "max": 9.0}], "sub_criteria": []}
{"criteria": "Application of Concepts to Justify the Solution and Evaluate Alternatives (30 Points)", "description": "This section focuses on how well the student applies concepts to justify their answer and evaluates alternative solutions.", "points": 30.0, "labels": [{"label": "High", "description": "The student applies concepts logically and accurately to justify the selected answer and thoroughly explains why alternative solutions are not suitable.", "min": 27.0, "max": 30.0}, {"label": "Medium", "description": "The justification is mostly correct but may include minor logical gaps or errors, with limited evaluation of alternative solutions.", "min": 19.0, "max": 26.0}, {"label": "Low", "description": "The justification is flawed or incomplete, with incorrect application of concepts and little consideration of alternatives.", "min": 10.0, "max": 18.0}, {"label": "Very Low", "description": "No meaningful justification is provided, and alternatives are not evaluated.", "min": 0.0, "max": 9.0}], "sub_criteria": []}
{"criteria": "Critical Analysis and Synthesis (10 Points)", "description": "This section assesses the student's ability to critically analyze the problem and synthesize information into a coherent conclusion.", "points": 10.0, "labels": [{"label": "High", "description": "The student demonstrates a strong ability to critically analyze the problem, synthesizing information into an insightful and coherent conclusion.", "min": 9.0, "max": 10.0}, {"label": "Medium", "description": "The student shows some analytical ability but may lack depth or insight in their synthesis.", "min": 6.0, "max": 8.0}, {"label": "Low", "description": "The analysis is shallow or incomplete, with minimal synthesis of information.", "min": 3.0, "max": 5.0}, {"label": "Very Low", "description": "The student shows no meaningful analysis or synthesis of information.", "min": 0.0, "max": 2.0}], "sub_criteria": []}
